In [1]:
#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Nov 13 21:25:33 2022

@author: Januario Cipriano
"""

'\nCreated on Sun Nov 13 21:25:33 2022\n\n@author: Januario Cipriano\n'

In [2]:
%autosave 5

Autosaving every 5 seconds

In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split

In [5]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import StandardScaler

In [6]:
df = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df.head(15)

    age     sex     bmi  children smoker     region      charges
0    19  female  27.900         0    yes  southwest  16884.92400
1    18    male  33.770         1     no  southeast   1725.55230
2    28    male  33.000         3     no  southeast   4449.46200
3    33    male  22.705         0     no  northwest  21984.47061
4    32    male  28.880         0     no  northwest   3866.85520
5    31  female  25.740         0     no  southeast   3756.62160
6    46  female  33.440         1     no  southeast   8240.58960
7    37  female  27.740         3     no  northwest   7281.50560
8    37    male  29.830         2     no  northeast   6406.41070
9    60  female  25.840         0     no  northwest  28923.13692
10   25    male  26.220         0     no  northeast   2721.32080
11   62  female  26.290         0    yes  southeast  27808.72510
12   23    male  34.400         0     no  southwest   1826.84300
13   56  female  39.820         0     no  southeast  11090.71780
14   27    male     NaN         0    yes  southeast  39611.75770

In [7]:
count_na = df.isnull().sum()
count_na

age         0
sex         0
bmi         5
children    0
smoker      0
region      0
charges     0
dtype: int64

In [8]:
count_na[count_na > 0]

bmi    5
dtype: int64

In [10]:
df.shape

(1338, 7)

In [12]:
df.drop('bmi', axis=1, inplace=True)

In [13]:
df.shape

(1338, 6)

In [14]:
count_na = df.isnull().sum()

In [15]:
count_na

age         0
sex         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [16]:
count_na[count_na > 0]

Series([], dtype: int64)

In [17]:
df2 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [18]:
count_na = df2.isnull().sum()
count_na

age         0
sex         0
bmi         5
children    0
smoker      0
region      0
charges     0
dtype: int64

In [19]:
count_na[count_na > 0]

bmi    5
dtype: int64

In [20]:
df2.dropna(inplace=True)
df2.reset_index(drop=True, inplace=True)

In [22]:
df2.shape

(1333, 7)

In [23]:
count_na = df2.isnull().sum()
count_na

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [24]:
count_na[count_na > 0]

Series([], dtype: int64)

In [25]:
df3 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [26]:
count_na = df3.isnull().sum()
count_na

age         0
sex         0
bmi         5
children    0
smoker      0
region      0
charges     0
dtype: int64

In [27]:
count_na[count_na > 0]

bmi    5
dtype: int64

In [28]:
imputer = SimpleImputer(strategy='mean')
imputer.fit(df3['bmi'].values.reshape(-1, 1))
df3['bmi'] = imputer.transform(df3['bmi'].values.reshape(-1, 1))

In [29]:
count_na = df.isnull().sum()
count_na

age         0
sex         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [30]:
count_na[count_na > 0]

Series([], dtype: int64)

In [31]:
df4 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [32]:
df4['bmi'].fillna(df4['bmi'].mean(), inplace=True)

In [33]:
count_na = df4.isnull().sum()
count_na

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [34]:
count_na[count_na > 0]

Series([], dtype: int64)

In [35]:
region = df3['region']
region_encoded, region_categories = pd.factorize(region)

In [36]:
factor_region_mapping = dict(zip(region_categories,
                                 region_encoded))

In [37]:
factor_region_mapping

{'southwest': 0, 'southeast': 1, 'northwest': 1, 'northeast': 2}

In [38]:
region[:10]

0    southwest
1    southeast
2    southeast
3    northwest
4    northwest
5    southeast
6    southeast
7    northwest
8    northeast
9    northwest
Name: region, dtype: object

In [39]:
region_categories

Index(['southwest', 'southeast', 'northwest', 'northeast'], dtype='object')

In [40]:
region_encoded[:10]

array([0, 1, 1, 2, 2, 1, 1, 2, 3, 2], dtype=int64)

In [41]:
region = df3['region']
region_encoded = pd.get_dummies(region, prefix='')

In [42]:
region_encoded

      _northeast  _northwest  _southeast  _southwest
0              0           0           0           1
1              0           0           1           0
2              0           0           1           0
3              0           1           0           0
4              0           1           0           0
...          ...         ...         ...         ...
1333           0           1           0           0
1334           1           0           0           0
1335           0           0           1           0
1336           0           0           0           1
1337           0           1           0           0

[1338 rows x 4 columns]

In [43]:
region[:10]

0    southwest
1    southeast
2    southeast
3    northwest
4    northwest
5    southeast
6    southeast
7    northwest
8    northeast
9    northwest
Name: region, dtype: object

In [44]:
region_encoded[:10]

   _northeast  _northwest  _southeast  _southwest
0           0           0           0           1
1           0           0           1           0
2           0           0           1           0
3           0           1           0           0
4           0           1           0           0
5           0           0           1           0
6           0           0           1           0
7           0           1           0           0
8           1           0           0           0
9           0           1           0           0

In [45]:
sex = df4.iloc[:, 1:2].values
smoker = df4.iloc[:, 4:5]

In [ ]:
le = LabelEncoder()
sex[:, ] = le.fit_transform(sex[:, 0])
sex = pd.DataFrame(sex)
sex.columns = 'sex'
le_